&НаКлиенте
Перем МодульМТ;  // Общий клиентский модуль со спецификой мобильной торговли


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УИДВладельца = Параметры.IDnew; // Объект.СправочникФотографии
	
	СтррКонтекст = Новый Структура; // общие значения модуля формы
	СтррКонтекст.Вставить("СпрФотографии");                                               
	
	СтррКонтекст.Вставить("мФото", ?(Параметры.Свойство("мФото"), Параметры.мФото, Неопределено)); //vd_190905

	ТекОбъект = РеквизитФормыВЗначение("Объект");		                          
	ТекОбъект.КонтекстФормыИнициализировать(СтррКонтекст, Параметры);
	ТекОбъект.ВОКонтекстФормыДополнить(СтррКонтекст, "_Фотографии", Истина);
	
	ПрочестьОбъектИзХранилища();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МодульМТ = ПолучитьФорму(СтррКонтекст.ПутьКФорме + "МодульОбщийМТ", СтррКонтекст, ЭтаФорма, "АгентПлюсМодульОбщийМТ"); // в СтррКонтекст есть заполненное свойство "ВХОбщиеПараметры"
	МодульМТ.ВОПриОткрытии(ЭтотОбъект);		

	//Отбор строк 
	//((vd_190708 отбор перенесен в ФормаОбновитьОтбор() 
	//	ОтборСтрок = Новый Структура;
	//	ОтборСтрок.Вставить("ВладелецФайла", УИДВладельца);
	//	Элементы.ТПЭлементы.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	//))
	
	ФормаОбновитьОтбор();
	
	ФормаОбновитьЗаголовок();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если МодульМТ.ОбработкаОповещенияФормы(ЭтотОбъект, ИмяСобытия, Параметр, Источник) Тогда
		
	ИначеЕсли ИмяСобытия = "АПЭлементСправочникаЗаписан_" + СтррКонтекст.ВО.ВидОбъекта Тогда
		
		//((vd_190905
		Если СтррКонтекст.Свойство("мФото") И Параметр.Свойство("мФото") Тогда
			СтррКонтекст.мФото = Параметр.мФото;
		ИначеЕсли НЕ СтррКонтекст.Свойство("мФото") И Параметр.Свойство("мФото") Тогда 	
			СтррКонтекст.Вставить("мФото", Параметр.мФото);
		ИначеЕсли СтррКонтекст.Свойство("мФото") Тогда
			СтррКонтекст.мФото = Неопределено;
		КонецЕсли;
		//))vd_190905
		
		ПрочестьОбъектИзХранилища();
		ФормаОбновитьОтбор(); //vd_190708
		МодульМТ.ВОЭлементыВыделить(ЭтотОбъект, Параметр);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормыЭлементовФормы

&НаКлиенте
Процедура СписокФотографийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	МодульМТ.ВООткрытьФормуИзФормыСписка(ЭтотОбъект, Истина, Копирование);
	
	//Отказ = Истина;
	//
	//ПараметрыФайлов= Новый Структура;
	//ПараметрыФайлов.Вставить("ВладелецФайла", ЭтаФорма);
	//ПараметрыФайлов.Вставить("ИдентификаторФормы", УникальныйИдентификатор);
	////Параметры.Вставить("Фильтр", Фильтр);
	//
	//ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьФайлыРасширениеПредложено", ЭтаФорма, ПараметрыФайлов);
	//ФайловыеФункцииСлужебныйКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокФотографийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	МодульМТ.ВОЭлементыВыбор(ЭтотОбъект);    

КонецПроцедуры

&НаКлиенте
Процедура ТПЭлементыПередУдалением(Элемент, Отказ)
		
	МодульМТ.ВОЭлементыПередПометкойУдаления(ЭтотОбъект, Элемент, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьОкончательно(Команда)
	
	МодульМТ.КомандаВыполнить(Команда, ЭтотОбъект)

КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	
	МодульМТ.КомандаВыполнить(Команда, ЭтотОбъект)
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочестьОбъектИзХранилища()

	ТекОбъект = РеквизитФормыВЗначение("Объект");
	
	тз = ТекОбъект.ВОТЗЗагрузить(СтррКонтекст.ВО);
	
	//((vd_190708 Заполнение ИмяФайла из ХранимыйФайл
	тз.Колонки.Добавить("ИмяФайла", Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("ОтображатьНаФорме", Новый ОписаниеТипов("Булево"));
	Для Каждого стз Из тз Цикл 
		// ИмяФайла
		Если ТипЗнч(стз.ХранимыйФайл) = Тип("Строка") И НЕ ПустаяСтрока(стз.ХранимыйФайл) Тогда
			ИндексТочки = Найти(стз.ХранимыйФайл, ".");
			Если ИндексТочки > 1 Тогда
				стз.ИмяФайла = Лев(стз.ХранимыйФайл, ИндексТочки - 1);
			Иначе
				стз.ИмяФайла = "";
			КонецЕсли;
		Иначе
			стз.ИмяФайла = "";
		КонецЕсли;
		// ОтображатьНаФорме
		стз.ОтображатьНаФорме = Истина;
		Если стз.ВладелецФайла <> УИДВладельца ИЛИ (СтррКонтекст.мФото <> Неопределено И СтррКонтекст.мФото.Найти(стз.ID) = Неопределено) Тогда
			стз.ОтображатьНаФорме = Ложь;
		КонецЕсли;		 
	КонецЦикла;
	//))vd_190708
	
	ТекОбъект[СтррКонтекст.ВО.РеквизитОбработки] = тз;
	
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");

КонецПроцедуры

//vd_190708 Добавлена
&НаКлиенте
Процедура ФормаОбновитьОтбор()
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("ОтображатьНаФорме", Истина);
	Элементы.ТПЭлементы.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаОбновитьЗаголовок()
		
	ЭтаФорма.Заголовок = НСтр("ru = 'Прикрепленные фотографии'");	
	
КонецПроцедуры

#КонецОбласти

///////////////////