&НаКлиенте
Перем МодульМТ;  // Общий клиентский модуль со спецификой мобильной торговли


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УИДВладельца = Параметры.IDnew; // Объект.СправочникФотографии
	
	СтррКонтекст = Новый Структура; // общие значения модуля формы
	СтррКонтекст.Вставить("СпрФотографии");
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");		
	ТекОбъект.КонтекстФормыИнициализировать(СтррКонтекст, Параметры);
	ТекОбъект.ВОКонтекстФормыДополнить(СтррКонтекст, "_Фотографии", Истина);
	
	ПрочестьОбъектИзХранилища();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МодульМТ = ПолучитьФорму(СтррКонтекст.ПутьКФорме + "МодульОбщийМТ", СтррКонтекст, ЭтаФорма, "АгентПлюсМодульОбщийМТ"); // в СтррКонтекст есть заполненное свойство "ВХОбщиеПараметры"
	МодульМТ.ВОПриОткрытии(ЭтотОбъект);		

	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("ВладелецФайла", УИДВладельца);
	Элементы.ТПЭлементы.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	
	ФормаОбновитьЗаголовок();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если МодульМТ.ОбработкаОповещенияФормы(ЭтотОбъект, ИмяСобытия, Параметр, Источник) Тогда
	ИначеЕсли ИмяСобытия = "АПЭлементСправочникаЗаписан_" + СтррКонтекст.ВО.ВидОбъекта Тогда
		ПрочестьОбъектИзХранилища();
		МодульМТ.ВОЭлементыВыделить(ЭтотОбъект, Параметр);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормыЭлементовФормы

&НаКлиенте
Процедура СписокФотографийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	МодульМТ.ВООткрытьФормуИзФормыСписка(ЭтотОбъект, Истина, Копирование);
	
	//Отказ = Истина;
	//
	//ПараметрыФайлов= Новый Структура;
	//ПараметрыФайлов.Вставить("ВладелецФайла", ЭтаФорма);
	//ПараметрыФайлов.Вставить("ИдентификаторФормы", УникальныйИдентификатор);
	////Параметры.Вставить("Фильтр", Фильтр);
	//
	//ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьФайлыРасширениеПредложено", ЭтаФорма, ПараметрыФайлов);
	//ФайловыеФункцииСлужебныйКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокФотографийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	МодульМТ.ВОЭлементыВыбор(ЭтотОбъект);    

КонецПроцедуры

&НаКлиенте
Процедура ТПЭлементыПередУдалением(Элемент, Отказ)
		
	МодульМТ.ВОЭлементыПередПометкойУдаления(ЭтотОбъект, Элемент, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьОкончательно(Команда)
	
	МодульМТ.КомандаВыполнить(Команда, ЭтотОбъект)

КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	
	МодульМТ.КомандаВыполнить(Команда, ЭтотОбъект)
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочестьОбъектИзХранилища()

	ТекОбъект = РеквизитФормыВЗначение("Объект");
	
	тз = ТекОбъект.ВОТЗЗагрузить(СтррКонтекст.ВО);
	ТекОбъект[СтррКонтекст.ВО.РеквизитОбработки] = тз;
	
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ФормаОбновитьЗаголовок()
		
	ЭтаФорма.Заголовок = НСтр("ru = 'Прикрепленные фотографии'");	
	
КонецПроцедуры

#КонецОбласти

///////////////////