
#Область ГлобальныеПеременные

&НаКлиенте
Перем МодульКарты;  // общий клиентский модуль работы с картами
&НаКлиенте
Перем гМодульК;  // общий клиентский модуль

// ГлобальныеПеременные
#КонецОбласти

#Область СовместимостьСПлатформой_8_3_5

// Подставляет параметры в строку. Максимально возможное число параметров - 5.
// Параметры в строке задаются как %<номер параметра>. Нумерация параметров начинается с единицы.
//
// Параметры:
//  СтрокаПодстановки  - Строка - шаблон строки с параметрами (вхождениями вида "%ИмяПараметра");
//  Параметр<n>        - Строка - подставляемый параметр.
//
// Возвращаемое значение:
//  Строка   - текстовая строка с подставленными параметрами.
//
&НаКлиентеНаСервереБезКонтекста
Функция СтрШаблон_(СтрокаПодстановки,
	Параметр1, Параметр2 = Неопределено, Параметр3 = Неопределено, Параметр4 = Неопределено, Параметр5 = Неопределено)
	
	Результат = СтрЗаменить(СтрокаПодстановки, "%1", Параметр1);
	Результат = СтрЗаменить(Результат, "%2", Параметр2);
	Результат = СтрЗаменить(Результат, "%3", Параметр3);
	Результат = СтрЗаменить(Результат, "%4", Параметр4);
	Результат = СтрЗаменить(Результат, "%5", Параметр5);
	
	Возврат Результат;
	
КонецФункции
	
// Разбивает строку на несколько строк по разделителю. Разделитель может иметь любую длину.
//
// Параметры:
//  Строка                 - Строка - текст с разделителями;
//  Разделитель            - Строка - разделитель строк текста, минимум 1 символ;
//  ПропускатьПустыеСтроки - Булево - признак необходимости включения в результат пустых строк.
//    Если параметр не задан, то функция работает в режиме совместимости со своей предыдущей версией:
//     - для разделителя-пробела пустые строки не включаются в результат, для остальных разделителей пустые строки
//       включаются в результат.
//     Е если параметр Строка не содержит значащих символов или не содержит ни одного символа (пустая строка), то в
//       случае разделителя-пробела результатом функции будет массив, содержащий одно значение "" (пустая строка), а
//       при других разделителях результатом функции будет пустой массив.
//  СокращатьНепечатаемыеСимволы - Булево - сокращать непечатаемые символы по краям каждой из найденных подстрок.
//
// Возвращаемое значение:
//  Массив - массив строк.
&НаКлиентеНаСервереБезКонтекста 
Функция СтрРазделить_(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено, СокращатьНепечатаемыеСимволы = Ложь)
	
	Результат = Новый Массив;
	
	// Для обеспечения обратной совместимости.
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Строка) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	//
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Если СокращатьНепечатаемыеСимволы Тогда
				Результат.Добавить(СокрЛП(Подстрока));
			Иначе
				Результат.Добавить(Подстрока);
			КонецЕсли;
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
		Если СокращатьНепечатаемыеСимволы Тогда
			Результат.Добавить(СокрЛП(Строка));
		Иначе
			Результат.Добавить(Строка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

///  Объединяет строки из массива в строку с разделителями.
//
// Параметры:
//  Массив      - Массив - массив строк которые необходимо объединить в одну строку;
//  Разделитель - Строка - любой набор символов, который будет использован в качестве разделителя.
//
// Возвращаемое значение:
//  Строка - строка с разделителями.
// 
&НаКлиентеНаСервереБезКонтекста 
Функция СтрСоединить_(Массив, Разделитель = ",", СокращатьНепечатаемыеСимволы = Ложь)

	Результат = "";
	ТекРазделитель = "";
	
	Для Индекс = 0 По Массив.ВГраница() Цикл
		
		Подстрока = Массив[Индекс];
		
		Если СокращатьНепечатаемыеСимволы Тогда
			Подстрока = СокрЛП(Подстрока);
		КонецЕсли;
		
		Если ТипЗнч(Подстрока) <> Тип("Строка") Тогда
			Подстрока = Строка(Подстрока);
		КонецЕсли;
		
		Результат = Результат + ТекРазделитель + Подстрока;
		
		Если Индекс = 0 Тогда
			ТекРазделитель = Разделитель;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

// СовместимостьСПлатформой_8_3_5
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтррКонтекст = Новый Структура("Повторно,КаталогИконок,ПрежниеЗначенияСтроки,ЗначениеБезТочности,КартаЦентр,РежимВыбораЦентраКарты,КоличествоМиганий,ОткрытыеПартнеры");
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");	
	ТекОбъект.КонтекстФормыИнициализировать(СтррКонтекст, Параметры);
	
	СтррКонтекст.Повторно = Ложь;
	
	СтррКонтекст.РежимВыбораЦентраКарты	= Ложь; // интерактивный режим выбора центра карты
	СтррКонтекст.КартаЦентр = ТекОбъект.ПрочитатьЗначениеНастройки("КартаЦентр"); // центр карты, выбранный до этого пользователем 
	СтррКонтекст.КоличествоМиганий = 0; //количество миганий координат в поле "ПартнерыКоординаты" после интерактивного изменения
	СтррКонтекст.КаталогИконок = ТекОбъект.ПолучитьВебКаталогИконок();
	
	СтррКонтекст.ПрежниеЗначенияСтроки = Новый Структура("Партнер,ИдентификаторСтроки"); // для восстановления значения строки элемента "Партнеры"
	СтррКонтекст.ЗначениеБезТочности = 99; // чтобы при интерактивной сортировке по точности определения координат строки без точности были в конце таблицы
	
	СтррКонтекст.ОткрытыеПартнеры = Новый Массив;
	
	СтррМаркер = Новый Структура("Широта,Долгота,Заголовок", 0, 0, "");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МодульКарты	= ПолучитьФорму(СтррКонтекст.ПутьКФорме + "МодульКарты", СтррКонтекст, ЭтаФорма, "АгентПлюсМодульКартыКлиент");	
	
	Если СтррКонтекст.КартаЦентр = Неопределено Тогда
		СохранитьЦентрКартыКлиент(МодульКарты.ПолучитьКоординатыПользователя());
	Иначе
		ОбновитьЗаголовокФормы();
	КонецЕсли;
	
	МодульКарты.УстановитьРегионГеокодера(СтррКонтекст.КартаЦентр); // для точности геокодирования
	
	Элементы.ГруппаКоманднаяПанель.ЦветФона = СтррКонтекст.Цвета.ФонРаздела;
	
	КартаПереключитьРежимВыбораКоординат();
	
	МодульКарты.ЗаполнитьСписокДоступныхКарт(Элементы.ИсточникКарты.СписокВыбора);
	ПроверитьГотовностьДополнительныхРеквизитов();
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ИсточникКарты;
	
	КартаОбновитьТекущийМакет();
	
	ОбновитьФлажокТолькоСПустымиКоординатами();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	СтррКонтекст.Повторно = Истина; // признак, что форма открыта повторно, используется чтобы учитывать загрузку карты в ПолеБраузера
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "АПНастройкиСброшены" Тогда
		
		ЭтаФорма.Модифицированность = Ложь;
		Закрыть();
		
	ИначеЕсли ИмяСобытия = "АППроверкаУникальностиЗапускаОбработкиОбмена" Тогда
		
		Если Параметр <> СтррКонтекст.ВХОбщиеПараметры Тогда // второй экземпляр обработки справшивает - уже открыта обработка или нет
			Оповестить("АПЗакрытьОбработкуОбменДанными", Параметр); // шлем событие закрытия обработки с конкретным ключем сеанса
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

// Параметр ИсточникВыбора принимает значение "ПриОткрытииФормы", если добавление партнеров вызвано извне 
// (при открытии или повторном открытии формы).
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		ВызватьИсключение("Не предусмотренное значение для подбора в форму: " + ВыбранноеЗначение);
	КонецЕсли; 
	
 	мНовыеПартнеры = Новый Массив; // массив добавленных партнеров во время подбора
	СтрокаТ = Неопределено;
	НачальнаяСтрока = Партнеры.Количество();
	
	ПроверятьНаПустыеКоординаты = Элементы.ПартнерыПризнакТолькоСПустымиКоординатами.Пометка;
	
	БезТочности = СтррКонтекст.ЗначениеБезТочности;
	ВыбранаОднаСтрока = (ВыбранноеЗначение.Количество() = 1);
	
	// подбор партнеров
	Для каждого Партнер Из ВыбранноеЗначение Цикл
		
		мСтроки = Партнеры.НайтиСтроки(Новый Структура("Партнер", Партнер));
		Если мСтроки.Количество() > 0 Тогда // в таблице уже есть такой партнер
			Если ВыбранаОднаСтрока Тогда
				СтрокаТ = мСтроки[0]; // выделяем найденную строку:
				ПоказатьПредупреждение(, НСтр("ru = 'Данный партнер уже выбран.'"));
				Прервать;
			Иначе
				Текст = СтрШаблон_(НСтр("ru = 'Пропущен партнер ""%1"" т.к. он уже выбран.'"), Партнер);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
				Продолжить;
			КонецЕсли;
		ИначеЕсли Не ПроверятьНаПустыеКоординаты Тогда // сразу добавляем партнеров в таблицу формы, иначе партнеры будут проверены на пустые координаты
			СтрокаТ = Партнеры.Добавить();
			СтрокаТ.Партнер  = Партнер;
			СтрокаТ.Точность = БезТочности;
		КонецЕсли;
		мНовыеПартнеры.Добавить(Партнер);
	
	КонецЦикла;
	
	// устанавливаем текущую строку
	СтрокаТ = ?(ИсточникВыбора = "ПриОткрытииФормы" И Партнеры.Количество() > 0, Партнеры[0], СтрокаТ);
	Если СтрокаТ <> Неопределено Тогда
		Элементы.Партнеры.ТекущаяСтрока = СтрокаТ.ПолучитьИдентификатор();	
	КонецЕсли; 		
	
	Если мНовыеПартнеры.Количество() <> 0 Тогда
		КоличествоПередДобавлением = мНовыеПартнеры.Количество();
		ОбновитьКоординатыПартнеров(мНовыеПартнеры, НачальнаяСтрока, Ложь, ПроверятьНаПустыеКоординаты);			
		ОбновитьАдресаПартнеров(мНовыеПартнеры, НачальнаяСтрока, Ложь);
		Если КоличествоПередДобавлением <> мНовыеПартнеры.Количество() И ПроверятьНаПустыеКоординаты Тогда
			Если КоличествоПередДобавлением = 1 Тогда
				Текст = НСтр("ru = 'У партнера указаны координаты'");
			ИначеЕсли мНовыеПартнеры.Количество() = 0 Тогда
			    Текст = НСтр("ru = 'Все выбранные партнеры с заполненными координатами'");
			Иначе
				Текст = НСтр("ru = 'Были исключены партнеры с заполненными координатами'");
			КонецЕсли; 
			ПоказатьПредупреждение(, Текст + " " + НСтр("ru = '(включен режим подбора только для партнеров с пустыми координатами).'"));
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЭтаФорма.Модифицированность Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("СохранитьПродолжить", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Данные были изменены. Сохранить изменения?'"), РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

// ОбработчикиСобытийФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОпределитьКоординатыПоАдресу(Команда)
	
	ОпределитьКоординатыПоАдресу();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранить(Команда)
	
	СохранитьКоординатыКлиент();

КонецПроцедуры

#Область ОбработчикиКомандФормы_ПартнерыКонтекстноеМеню

&НаКлиенте
Процедура КомандаСнятьПризнакИзмененияКоординат(Команда)

	УстановитьПризнакИзмененияКоординат(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьПризнакИзмененияКоординат(Команда)
	
	УстановитьПризнакИзмененияКоординат(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСортироватьПоТочностиКоординат(Команда)
	Партнеры.Сортировать("Точность,Партнер");
КонецПроцедуры

// ОбработчикиКомандФормы_ПартнерыКонтекстноеМеню
#КонецОбласти

#Область ОбработчикиКомандФормы_ПодборПартнеров

&НаКлиенте
Процедура КомандаПодборПартнеровИзСправочника(Команда)

	СтррПараметры = Новый Структура;	
	СтррПараметры.Вставить("ЗакрыватьПриВыборе", Ложь); 
	СтррПараметры.Вставить("МножественныйВыбор", Истина); 
		
	ОткрытьФорму("Справочник.Партнеры.ФормаВыбора", СтррПараметры, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодборПартнеровИзСпискаТТ(Команда)
	
	СтррПараметры  = Новый Структура("ID,ДляВыбора", Неопределено, Истина);
	Если ЭтаФорма.КлючУникальности = Неопределено Тогда
		ЭтаФорма.КлючУникальности = Новый УникальныйИдентификатор;
	КонецЕсли; 
	Оповещение = Новый ОписаниеОповещения("СписокТорговыхТочекВыборЗавершение", ЭтотОбъект, Неопределено);
	МодульК().ОткрытьФормуОбработки("СпискиТорговыхТочек", СтррПараметры, ЭтаФорма.КлючУникальности, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьВсехПартнеров(Команда)
	
	Если Партнеры.Количество() <> 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ДобавитьВсехПартнеровПродолжить", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Перед добавленинем всех партнеров таблица будет очищена. Продолжить?'"), РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		ПартнерыДобавитьВсехПартнеровКлиент();
	КонецЕсли; 
	
КонецПроцедуры

// Сохранение измененных координат для Партнеров с признаком КоординатыИзменены.
&НаКлиенте
Процедура ДобавитьВсехПартнеровПродолжить(РезультатОтвета, ДополнительныеПараметры) Экспорт
	
	Если РезультатОтвета = КодВозвратаДиалога.Да Тогда
		ПартнерыДобавитьВсехПартнеровКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПризнакТолькоСПустымиКоординатами(Команда)
	
	ТолькоСПустымиКоординатами = Не ТолькоСПустымиКоординатами;
	ОбновитьФлажокТолькоСПустымиКоординатами();
	
КонецПроцедуры

// ОбработчикиКомандФормы_ПодборПартнеров
#КонецОбласти 

&НаКлиенте
Процедура КомандаУказатьЦентрКарты(Команда)
	
	СтррПараметры = Неопределено;
	Оповещение = Новый ОписаниеОповещения("КомандаУказатьЦентрКартыПродолжить", ЭтотОбъект);
	МодульК().ОткрытьФормуОбработки("ВыборЦентраКарты", СтррПараметры,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУказатьЦентрКартыПродолжить(Центр, ДополнительныеПараметры) Экспорт
	
	Если Центр <> Неопределено Тогда
		
		Если ТипЗнч(Центр) = Тип("Структура") Тогда
			
			СохранитьЦентрКартыКлиент(Центр);
			ЗаполнитьЗначенияСвойств(СтррМаркер, Центр);
			КартаПерейтиКМаркеру(Истина);
			КартаДобавитьМаркер(Истина);
			
		ИначеЕсли Центр = "ВыбратьНаКарте" Тогда // включаем режим выбора центра на карте
			
			КартаПереключитьРежимВыбораКоординат(Истина, Истина);
		
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	
	МодульК().КомандаВыполнить(Команда, ЭтотОбъект)
	
КонецПроцедуры

// ОбработчикиКомандФормы
#КонецОбласти

#Область ОбработчикиСобытиЭлементовФормы

&НаКлиенте
Процедура ИсточникКартыПриИзменении(Элемент)
	
	КартаОбновитьТекущийМакет();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеБраузераДокументСформирован(Элемент)

	#Если ВебКлиент Тогда
		СисИнфо = Новый СистемнаяИнформация;
		Если Найти(СисИнфо.ИнформацияПрограммыПросмотра, "Firefox") = 0 Тогда
			Документ = Элементы.ПолеБраузера.document;
			HTMLWindow = ?(Документ.parentWindow <> Неопределено, Документ.parentWindow, Документ.defaultView);
			HTMLWindow.name = КартаСформироватьПараметрРежимРедактора("LabelEditor", СтррКонтекст.КартаЦентр);
		КонецЕсли;
	#КонецЕсли 
	
	Таймер_Включить("ДобавитьМаркер");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеБраузераПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)

	Если Не РежимВыбораКоординат Или ДанныеСобытия.Button = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Источник = ДанныеСобытия.Button;
	
	Если Источник.id <> "ClickEvent" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Если Источник.apObjectType <> "map" Тогда
		Возврат;
	КонецЕсли;
	
	мКоординаты = СтрРазделить_(Источник.apValue);
	Если мКоординаты.Количество() <> 2 Тогда
		Возврат;
	КонецЕсли;
	
	Широта  = СтрокуВЧисло(мКоординаты[0]);
	Долгота = СтрокуВЧисло(мКоординаты[1]);
	
	// кликом по карте указаны новые координаты маркера
	стррМаркер.Широта  = Широта;
	стррМаркер.Долгота = Долгота;
	
	стррПараметры = Новый Структура("Широта,Долгота", Широта, Долгота);
	
	Если СтррКонтекст.РежимВыбораЦентраКарты Тогда // режим указания координат для центра карты
		Оповещение = Новый ОписаниеОповещения("ЗапомнитьНовыеКоординатыЦентраКартыПродолжить", ЭтотОбъект, стррПараметры);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Запомнить новые координаты центра карты?'"), РежимДиалогаВопрос.ДаНетОтмена);
		// пока еще не показан вопрос, определим по координатам город
		стррЦентр = Новый Структура("Широта,Долгота", стррПараметры.Широта, стррПараметры.Долгота);
		стррПараметры.Вставить("Город", МодульКарты.ПолучитьАдресПоКоординатамОтВебСервиса(стррЦентр, Истина));
	ИначеЕсли ПартнерыУстановитьНовыеКоординатыДляТекущегоПартнера(стррПараметры, Ложь) Тогда // режим указания координат для текущего партнера
		МигатьКоординатами();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапомнитьНовыеКоординатыЦентраКартыПродолжить(РезультатОтвета, стррПараметры) Экспорт
	
	Если РезультатОтвета = КодВозвратаДиалога.Да Тогда
		КартаПереключитьРежимВыбораКоординат(Ложь);
		СохранитьЦентрКартыКлиент(стррПараметры); // запоминаем центр карты в хранилище
	ИначеЕсли РезультатОтвета = КодВозвратаДиалога.Нет Тогда
		КартаПереключитьРежимВыбораКоординат(Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РежимВыбораКоординатПриИзменении(Элемент)
	
	КартаПереключитьРежимВыбораКоординат();
	
КонецПроцедуры

// ОбработчикиСобытиЭлементовФормы
#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыПартнеры

&НаКлиенте
Процедура ПартнерыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПартнерыПриИзменении(Элемент)
	
	СтрокаТ = Элемент.ТекущиеДанные;
	
	Если СтрокаТ <> Неопределено Тогда
		
		ЭлементИмя = Элемент.ТекущийЭлемент.Имя;
			
		Если ЭлементИмя = "ПартнерыШирота" Или ЭлементИмя = "ПартнерыДолгота" Тогда
			
			СтрокаТ.КоординатыИзменены = Истина;
			УстановитьМодифицированостьФормы(Истина);
			
		ИначеЕсли ЭлементИмя = "ПартнерыКоординатыИзменены"  Тогда			
			
			Если СтрокаТ.КоординатыИзменены Тогда
				УстановитьМодифицированостьФормы(Истина);
			КонецЕсли; 
			
		КонецЕсли;

	КонецЕсли; // Если СтрокаТ <> Неопределено
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерыПартнерПриИзменении(Элемент)
	
	СтрокаТ = Элементы.Партнеры.ТекущиеДанные;

	// Проверяем, не выбрали ли партнера, который уже есть в таблице
	Если ЗначениеЗаполнено(СтрокаТ.Партнер) Тогда
		мСтроки = Партнеры.НайтиСтроки(Новый Структура("Партнер", СтрокаТ.Партнер));
		Если мСтроки.Количество() > 1 Тогда // т.е. в таблице как минимум есть два таких партнера
			Текст = СтрШаблон_(НСтр("ru = 'Партнер ""%1"" уже присутствует в таблице.'"), СтрокаТ.Партнер);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, Неопределено, "Партнеры[" + СтрокаТ.ПолучитьИдентификатор() + "]");
			// восстанавливаем прежнее значение партнера
			ПрежниеЗначения = СтррКонтекст.ПрежниеЗначенияСтроки;
			Если ПрежниеЗначения.ИдентификаторСтроки = СтрокаТ.ПолучитьИдентификатор() Тогда
				СтрокаТ.Партнер = ПрежниеЗначения.Партнер;
			КонецЕсли;
		Иначе
			ЗаполнитьЗначенияСвойств(СтррКонтекст.ПрежниеЗначенияСтроки, СтрокаТ);
			СтррКонтекст.ПрежниеЗначенияСтроки.ИдентификаторСтроки = СтрокаТ.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
	ПроставитьАдресИКоординатыПартнера(Партнеры.Индекс(СтрокаТ));// Элементы.Партнеры.ТекущаяСтрока - возвращает другой индекс после сортировки таблицы
	Элементы.Партнеры.ЗакончитьРедактированиеСтроки(Ложь); // почему-то в платформе (8.3.8.1784) продолжается редактирование поля (выделен текст поля синим фоном)
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерыПартнерОткрытие(Элемент, СтандартнаяОбработка)
	
	СтрокаТ = Элементы.Партнеры.ТекущиеДанные;
	Если СтрокаТ = Неопределено Или Не ЗначениеЗаполнено(СтрокаТ.Партнер) Тогда
		Возврат;
	КонецЕсли; 
	Если СтррКонтекст.ОткрытыеПартнеры.Найти(СтрокаТ.Партнер) = Неопределено Тогда
		СтррКонтекст.ОткрытыеПартнеры.Добавить(СтрокаТ.Партнер);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерыПриАктивизацииСтроки(Элемент)

	СтрокаТ = Элемент.ТекущиеДанные;
	Если СтрокаТ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Запоминаем некоторые знаечения текущей строки на случай, если потребуется восстановить прежнее значение в строке
	ЗаполнитьЗначенияСвойств(СтррКонтекст.ПрежниеЗначенияСтроки, СтрокаТ);
	СтррКонтекст.ПрежниеЗначенияСтроки.ИдентификаторСтроки = СтрокаТ.ПолучитьИдентификатор();
	
	Если ЭтаФорма.ТекущийЭлемент.Имя = "Партнеры" Тогда
		
		КартаПерейтиКМаркеруТекущегоПартнера(Истина);
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаТ = Элемент.ТекущиеДанные;
	Если СтрокаТ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементИмя = Элемент.ТекущийЭлемент.Имя;
	
	Если ЭлементИмя = "ПартнерыКоординаты" Тогда
		
		стррПараметры = Новый Структура("Широта,Долгота", СтрокаТ.Широта, СтрокаТ.Долгота);
		
		Оповещение = Новый ОписаниеОповещения("ПартнерыВыборКоординатЗавершение", ЭтотОбъект);
		МодульК().ОткрытьФормуОбработки("ВыборКоординат", Новый Структура("Значения", стррПараметры),, Оповещение);
		
	ИначеЕсли ЭлементИмя = "ПартнерыАдресКоординат" Или ЭлементИмя = "ПартнерыТочность" Тогда
		
		ОпределитьКоординатыПоАдресу(Истина);
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерыВыборКоординатЗавершение(стррРезультат, ДополнительныеПараметры) Экспорт
    
	Если ТипЗнч(стррРезультат) = Тип("Структура") Тогда
		ПартнерыУстановитьНовыеКоординатыДляТекущегоПартнера(стррРезультат, Истина);
		МигатьКоординатами();
	КонецЕсли;

КонецПроцедуры

// Функция устанавливает новые координаты для текущего партнера в элементе "Партнеры".
// Возаращает Истина, если новые координаты отличаются от старых.
&НаКлиенте
Функция ПартнерыУстановитьНовыеКоординатыДляТекущегоПартнера(стррКоординаты, ФокусНаПартнерах)
	
	УстановленыНовыеКоординаты = Ложь;
	
	СтрокаТ = Элементы.Партнеры.ТекущиеДанные;
	Если СтрокаТ <> Неопределено Тогда
		
		Точность 	= ?(СтрокаТ.Широта = 0 Или СтрокаТ.Долгота = 0, СтррКонтекст.ЗначениеБезТочности, 1); //1 - максимальная точность
		Если СтрокаТ.Широта	<> стррКоординаты.Широта Или СтрокаТ.Долгота <> стррКоординаты.Долгота Или СтрокаТ.Точность <> Точность Тогда
			УстановленыНовыеКоординаты = Истина;
		КонецЕсли; 			
		
		ЗаполнитьЗначенияСвойств(СтрокаТ, стррКоординаты, "Широта,Долгота");
		СтрокаТ.Точность = Точность;

		СтрокаТ.Координаты  = ПредставлениеКоординатNMEA(СтрокаТ.Широта, СтрокаТ.Долгота);
		СтрокаТ.КоординатыИзменены = Истина;
		УстановитьМодифицированостьФормы(Истина);
		Если ФокусНаПартнерах Тогда
			ЭтаФорма.ТекущийЭлемент = Элементы.Партнеры; // оставляем фокус на таблице партнеров		
		КонецЕсли; 
	КонецЕсли;
	
	Возврат УстановленыНовыеКоординаты;
	
КонецФункции


&НаКлиенте
Процедура ПартнерыПослеУдаления(Элемент)
	
	Если ЭтаФорма.Модифицированность И Партнеры.Количество() = 0 Тогда // если удалены все партнеры из формы, снимаем признак модифицированности формы
		УстановитьМодифицированостьФормы(Ложь);
	КонецЕсли; 
	
КонецПроцедуры

// ОбработчикиСобытийЭлементовТаблицыФормыПартнеры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныеПроцедурыИФункции_Прочие

&НаКлиенте
Процедура УстановитьМодифицированостьФормы(Режим)
	
	ЭтаФорма.Модифицированность = Режим;
	Элементы.Сохранить.ЦветТекста = СтррКонтекст.Цвета[?(Режим, "ТекстВнимание", "Авто")];
	
КонецПроцедуры

// Преобразует строку в число без вызова исключений. Стандартная функция преобразования
//   Число() контролирует отсутствие каких либо символов кроме числовых.
//
&НаКлиентеНаСервереБезКонтекста
Функция СтрокуВЧисло(ИсходнаяСтрока)

	ИсхСтрока = СокрЛП(ИсходнаяСтрока);
	Длина = СтрДлина(ИсхСтрока);
	стрЧисло = "";
	Для Поз = 1 По Длина Цикл
		Символ = Сред(ИсхСтрока, Поз, 1);
		Код = КодСимвола(Символ);
		Если Код >= 48 И Код <= 57 Тогда 
			стрЧисло = стрЧисло + Символ;
		ИначеЕсли Код = 46 Или Код = 44 Тогда // Символ "." или ","
			стрЧисло = стрЧисло + ".";
		КонецЕсли;
	КонецЦикла;

	Возврат ?(ПустаяСтрока(стрЧисло), 0, Число(стрЧисло));

КонецФункции

&НаКлиенте
Процедура СохранитьЦентрКартыКлиент(стррЦентр)
	
	Если ТипЗнч(стррЦентр) = Тип("Структура") Тогда
		СтррКонтекст.КартаЦентр = стррЦентр;	
		ОбновитьЗаголовокФормы();
		МодульКарты.УстановитьРегионГеокодера(стррЦентр); // для точности геокодирования
		МодульКарты.СохранитьЦентрКартыКлиент(стррЦентр);
	КонецЕсли; 
	
КонецПроцедуры	

&НаКлиенте
Функция МодульК()

	Если гМодульК = Неопределено Тогда
	    гМодульК = ПолучитьФорму(СтррКонтекст.ПутьКФорме + "МодульОбщий", СтррКонтекст);
	КонецЕсли; 
	
	Возврат гМодульК;

КонецФункции

// СлужебныеПроцедурыИФункции_Прочие
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции_РаботаСФормой

&НаКлиенте 
Процедура ОбновитьЗаголовокФормы()
	
	стррЦентр = СтррКонтекст.КартаЦентр;
	ЭтаФорма.Заголовок = НСтр("ru = 'Редактор меток на карте'") 
		+ ?(ТипЗнч(стррЦентр) = Тип("Структура") И стррЦентр.Свойство("Город") И ЗначениеЗаполнено(стррЦентр.Город), " - " + стррЦентр.Город, "");
	
КонецПроцедуры
	
&НаКлиенте 
Процедура ОбновитьФлажокТолькоСПустымиКоординатами()
	
	Элементы.ПартнерыПризнакТолькоСПустымиКоординатами.Пометка = ТолькоСПустымиКоординатами;

КонецПроцедуры

&НаКлиенте
Процедура ВнешнийВызовДобавитьИПоказатьПартнеров(мПартнеры) Экспорт
	
	Если мПартнеры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	Партнеры.Очистить();
	ТолькоСПустымиКоординатами = Ложь; // чтобы не игнорировались партнеры из массива, у кого заполнены координаты
	
	ОбработкаВыбора(мПартнеры, "ПриОткрытииФормы");

	Если СтррКонтекст.Повторно Тогда // форма открыта повторно, карта уже загружена
		КартаПерейтиКМаркеруТекущегоПартнера(Истина);	
	Иначе // форма открыта впервые, дожидаемся когда будет загружена карта - через отсрочку и попытку/исключение
		Таймер_Включить("!КартаПерейтиКМаркеруТекущегоПартнера(Истина)"); // команда не поддерживается на веб-клиенте!
	КонецЕсли; 

КонецПроцедуры

// СлужебныеПроцедурыИФункции_РаботаСФормой
#КонецОбласти

#Область СлужебныеПроцедурыИФункции_КИПартнеров

&НаКлиенте
Процедура УстановитьПризнакИзмененияКоординат(КоординатыИзменены)

	Если Элементы.Партнеры.ТекущиеДанные <> Неопределено Тогда
		
		мСтроки = Новый Массив; // предварительно запоминаем выделенные строки в промежуточном массиве
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(мСтроки, Элементы.Партнеры.ВыделенныеСтроки);
		// применяем действие к выделенным строкам
		Для Каждого ИдСтроки Из мСтроки Цикл
			СтрокаТ = Партнеры.НайтиПоИдентификатору(ИдСтроки);
			СтрокаТ.КоординатыИзменены = КоординатыИзменены;
		КонецЦикла;
		
		Если КоординатыИзменены Тогда
			УстановитьМодифицированостьФормы(Истина);	
		КонецЕсли; 
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура УстановитьНовыеКоординаты(СтрокаТ, стрКоординаты, стрАдресКоординат)
	
	СтрокаТ.АдресКоординат = стрАдресКоординат;
	мКоординаты = СтрРазделить_(стрКоординаты, " ");
	СтрокаТ.Широта   = мКоординаты[0];
	СтрокаТ.Долгота  = мКоординаты[1];
	СтрокаТ.Точность = мКоординаты[2];
	СтрокаТ.Координаты = ПредставлениеКоординатNMEA(СтрокаТ.Широта, СтрокаТ.Долгота);
	СтрокаТ.КоординатыИзменены = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПроставитьАдресИКоординатыПартнера(ИндексСтроки)
	
	СтрокаТ = Партнеры[ИндексСтроки]; 
	
	Если Не ЗначениеЗаполнено(СтрокаТ.Партнер) Тогда
		СтрокаТ.Адрес = "";
		СтрокаТ.Долгота = 0;
		СтрокаТ.Широта  = 0;
		СтрокаТ.Координаты = ПредставлениеКоординатNMEA(СтрокаТ.Широта, СтрокаТ.Долгота);		
		СтрокаТ.Точность = СтррКонтекст.ЗначениеБезТочности;
	Иначе
		мПартнеры = Новый Массив;
		мПартнеры.Добавить(СтрокаТ.Партнер);
		ОбновитьКоординатыПартнеров(мПартнеры, ИндексСтроки, Истина, Ложь);		
		ОбновитьАдресаПартнеров(мПартнеры, ИндексСтроки, Истина);
	КонецЕсли; 
		
КонецПроцедуры

// Процедура обновляет координаты партнеров на форме (если параметр ИсключитьСЗаполненнымиКоординатами = Ложь).
// Если параметр ИсключитьСЗаполненнымиКоординатами установлен в Истина, то из массива мПартнеры
// удаляются партнеры, у которых заполнены координаты, остальные добавляются в таблицу партнеров на форме.
&НаСервере
Процедура ОбновитьКоординатыПартнеров(мПартнеры, НачальнаяСтрока, ВОднойСтроке, ИсключитьСЗаполненнымиКоординатами)
	
	БезТочности = СтррКонтекст.ЗначениеБезТочности;
	
	тзКоординаты = ПолучитьТЗКоординатПартнеров(мПартнеры);
	
	СтррПоиск = Новый Структура("Ссылка");
	
	Если ИсключитьСЗаполненнымиКоординатами Тогда // нужно добавить в ТЗ Партнеры новые строки, иначе строки уже добавлены
		// Партнеры еще не включены в таблицу Партнеры на форме.
		// Исключаем из мПартнеры тех, у кого есть координаты. В тзКоординаты у нас сейчас те партнеры, у кого заполнены координаты.		
		// Остальных партнеров добавляем на форму.
		НачальнаяСтрока = Партнеры.Количество();
		мДобавленныеПартнеры = Новый Массив;
		Для каждого Партнер Из мПартнеры Цикл
			СтррПоиск.Ссылка = Партнер;
			мСтроки = тзКоординаты.НайтиСтроки(СтррПоиск);
			Если мСтроки.Количество() = 0 Тогда // добавбяем нового партнера на форму
				СтрокаТ = Партнеры.Добавить();
				СтрокаТ.Партнер = Партнер;
				СтрокаТ.Точность = БезТочности;
				мДобавленныеПартнеры.Добавить(Партнер);
			КонецЕсли; 
		КонецЦикла;
		мПартнеры = мДобавленныеПартнеры; // оставляем в массиве мПартнеры только партнеров с пустыми координатами
		
	ИначеЕсли НачальнаяСтрока = 0 И Не ВОднойСтроке Тогда // обновляем координаты для всей таблицы партнеров на форме
		// Партнеры уже включены в таблицу Партнеры на форме.
		Для каждого СтрокаТ Из Партнеры Цикл
			СтррПоиск.Ссылка = СтрокаТ.Партнер;
			мСтроки = тзКоординаты.НайтиСтроки(СтррПоиск);
			Если мСтроки.Количество() > 0 Тогда
				СтрокаТ.Широта  = мСтроки[0].Широта;
				СтрокаТ.Долгота = мСтроки[0].Долгота;
				СтрокаТ.АдресКоординат = мСтроки[0].Адрес;
			Иначе
				СтрокаТ.Широта  = 0;
				СтрокаТ.Долгота = 0;
				СтрокаТ.АдресКоординат = "";
			КонецЕсли;
			СтрокаТ.Точность = БезТочности;
			СтрокаТ.Координаты = ПредставлениеКоординатNMEA(СтрокаТ.Широта, СтрокаТ.Долгота);
			СтрокаТ.КоординатыИзменены = Ложь;
		КонецЦикла; 
		
	Иначе // обновляем координаты для партнеров начиная с указанной строки таблицы партнеров на форме и ниже
		// Партнеры уже включены в таблицу Партнеры на форме.
		ПоследняяСтрока = ?(ВОднойСтроке, НачальнаяСтрока, Партнеры.Количество() - 1);
		Для НомерСтроки = НачальнаяСтрока По ПоследняяСтрока Цикл
			СтрокаТ = Партнеры[НомерСтроки]; //Партнеры.НайтиПоИдентификатору(НомерСтроки); 
			СтррПоиск.Ссылка = СтрокаТ.Партнер;
			мСтроки = тзКоординаты.НайтиСтроки(СтррПоиск);
			Если мСтроки.Количество() > 0 Тогда
				СтрокаТ.Широта  = мСтроки[0].Широта;
				СтрокаТ.Долгота = мСтроки[0].Долгота;
				СтрокаТ.АдресКоординат = мСтроки[0].Адрес;
			Иначе
				СтрокаТ.Широта  = 0;
				СтрокаТ.Долгота = 0;
				СтрокаТ.АдресКоординат = "";
			КонецЕсли;
			СтрокаТ.Точность = БезТочности;
			СтрокаТ.Координаты = ПредставлениеКоординатNMEA(СтрокаТ.Широта, СтрокаТ.Долгота);
			СтрокаТ.КоординатыИзменены = Ложь;
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПопыткаОбновитьАдресаПартнеров(мПартнеры, СтрокаТ = Неопределено, УбиратьПартнеровИзМассива = Истина)
	
	Если СтрокаТ <> Неопределено Тогда
		ИндексВМассиве = ?(ЗначениеЗаполнено(СтрокаТ.Партнер), мПартнеры.Найти(СтрокаТ.Партнер), Неопределено);
		Если ИндексВМассиве <> Неопределено Тогда
			мПартнер = Новый Массив();
			мПартнер.Добавить(СтрокаТ.Партнер);
			ОбновитьАдресаПартнеров(мПартнеры, Партнеры.Индекс(СтрокаТ), Истина);
			Если УбиратьПартнеровИзМассива Тогда
			    мПартнеры.Удалить(ИндексВМассиве);
			КонецЕсли; 
		КонецЕсли; 
	Иначе
		ОбновитьАдресаПартнеров(мПартнеры, Неопределено, Ложь);
		Если УбиратьПартнеровИзМассива Тогда
			мПартнеры.Очистить();
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьАдресаПартнеров(мПартнеры, НачальнаяСтрока, ВОднойСтроке)
	
	Если мПартнеры.Количество() = 0 Или Партнеры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	мВидыКИ = Новый Массив;
	мВидыКИ.Добавить(Справочники.ВидыКонтактнойИнформации.АдресПартнера);
	
	тзАдреса = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(мПартнеры,, мВидыКИ);
	стррПоиск = Новый Структура("Объект"); // структура для поиска партнера в тзАдреса
	
	Если НачальнаяСтрока = 0 И Не ВОднойСтроке Тогда // обновление всех строк ТЗ Партнеры
		Для каждого СтрокаТ Из Партнеры Цикл
			ОбновитьАдресПартнера(СтрокаТ, тзАдреса, СтррПоиск);
		КонецЦикла; 
	ИначеЕсли НачальнаяСтрока = Неопределено Тогда // обновляем только те строки, у которых Партнер в массиве мПартнеры
		стррПоискВТЗПартнеры = Новый Структура("Партнер");
		Для Каждого Партнер Из мПартнеры Цикл
			стррПоискВТЗПартнеры.Партнер = Партнер;
			мСтроки = Партнеры.НайтиСтроки(стррПоискВТЗПартнеры);
			Если мСтроки.Количество() <> 0 Тогда
				ОбновитьАдресПартнера(мСтроки[0], тзАдреса, СтррПоиск);
			КонецЕсли; 
		КонецЦикла; 
	Иначе // обновление строк, начиная с НачальнаяСтрока и до последней строки ТЗ Партнеры
		ПоследняяСтрока = ?(ВОднойСтроке, НачальнаяСтрока, Партнеры.Количество() - 1);
		Для НомерСтроки = НачальнаяСтрока По ПоследняяСтрока Цикл
			ОбновитьАдресПартнера(Партнеры[НомерСтроки], тзАдреса, СтррПоиск); // Партнеры.НайтиПоИдентификатору(НомерСтроки); 
		КонецЦикла; 
	КонецЕсли; 
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьАдресПартнера(стзПартнеры, тзАдреса, СтррПоиск)
	СтррПоиск.Объект = стзПартнеры.Партнер;
	мСтроки = тзАдреса.НайтиСтроки(СтррПоиск);
	стзПартнеры.Адрес = ?(мСтроки.Количество() > 0, мСтроки[0].Представление, "");
КонецПроцедуры
 
&НаСервере
Функция ПолучитьТЗКоординатПартнеров(мПартнеры)
	
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьТЗКоординатПартнеров(мПартнеры);

КонецФункции

&НаСервере
Процедура ПроверитьГотовностьДополнительныхРеквизитов()
	
	СтррРезультат = РеквизитФормыВЗначение("Объект").ПроверитьДополнительныеРеквизитыСправочникаПартнеры();
	
	Если СтррРезультат.ЕстьОшибки Тогда
		Для каждого Текст Из СтррРезультат.Сообщения Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ПартнерыПолучитьКоординатыТекущегоПартнераДлаМаркера()
	
	СтрокаТ = Элементы.Партнеры.ТекущиеДанные;
	Если СтрокаТ <> Неопределено И СтрокаТ.Широта <> 0 Тогда
		Возврат Новый Структура("Широта,Долгота,Заголовок", СтрокаТ.Широта, СтрокаТ.Долгота, СтрокаТ.Партнер);
	Иначе
		Возврат Неопределено;
	КонецЕсли; 

КонецФункции


#Область СлужебныеПроцедурыИФункции_КИПартнеров_ВебСервис

&НаКлиенте
Процедура ОпределитьКоординатыПоАдресу(ТолькоДляТекущейСтроки = Ложь)
	
	Если Партнеры.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru = 'Сначала подберите в данную таблицу партнеров.'"), Неопределено, "Партнеры");
		Возврат;
	ИначеЕсли Элементы.Партнеры.ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(Неопределено, Нстр("ru = 'Выберите в таблице нужных партнеров и повторите попытку.'")); // gi_170902
		Возврат;
	КонецЕсли; 
	
	БылиИзменения = Ложь;
	мСтроки = Новый Массив; // предварительно запоминаем выделенные строки в промежуточном массиве
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(мСтроки, Элементы.Партнеры.ВыделенныеСтроки);
	
	Если мСтроки.Количество() = 1 Или ТолькоДляТекущейСтроки Тогда
		СтрокаТ = ?(ТолькоДляТекущейСтроки, Элементы.Партнеры.ТекущиеДанные, Партнеры.НайтиПоИдентификатору(мСтроки[0]));
		ПопыткаОбновитьАдресаПартнеров(СтррКонтекст.ОткрытыеПартнеры, СтрокаТ); // если открывалась карточка партнера из формы, возможно у нее изменен адрес
		Если ПустаяСтрока(СтрокаТ.Адрес) Тогда
			Текст = СтрШаблон_(Нстр("ru = 'У партнера ""%1"" не указан адрес. Определение координат для данного партнера невозможно.'"), СтрокаТ.Партнер);
		    ПоказатьПредупреждение(, Текст);
			Возврат;
		КонецЕсли; 
		списКоординаты = МодульКарты.ПолучтьКоординатыОтВебСервиса(СтрокаТ.Адрес, Ложь);
		Если списКоординаты <> Неопределено Тогда
			Если списКоординаты.Количество() = 1 Тогда // найден единственный адрес
				УстановитьНовыеКоординаты(СтрокаТ, списКоординаты[0].Значение, списКоординаты[0].Представление);
				МигатьКоординатами();
				БылиИзменения = Истина;
			Иначе // предлагаем пользователю выбрать координаты + адрес из списка
				Оповещение = Новый ОписаниеОповещения("КоординатыОбработкаВыбораИзСписка", ЭтотОбъект);
				списКоординаты.ПоказатьВыборЭлемента(Оповещение, Нстр("ru = 'Выберите координаты по адресу'"));
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		ПопыткаОбновитьАдресаПартнеров(СтррКонтекст.ОткрытыеПартнеры); // если открывалась карточки партнеров из формы, возможно у них изменен адрес
		
		Всего = мСтроки.Количество();
		ТекПроцент = Неопределено;
		
		Для Шаг = 1 По Всего Цикл
			Процент = Цел(100 * Шаг / Всего);
			Если Процент <> ТекПроцент Тогда
				ТекПроцент = Процент;
				Состояние(Нстр("ru = 'Получение координат...'"), Процент);
			КонецЕсли; 
			СтрокаТ = Партнеры.НайтиПоИдентификатору(мСтроки[Шаг-1]);
			стррКоординаты = МодульКарты.ПолучтьКоординатыОтВебСервиса(СтрокаТ.Адрес, Истина);
			Если стррКоординаты <> Неопределено Тогда
				УстановитьНовыеКоординаты(СтрокаТ, стррКоординаты.Координаты, стррКоординаты.Адрес);
				БылиИзменения = Истина;
			КонецЕсли; 
		КонецЦикла;
		
	КонецЕсли; 
	
	Если БылиИзменения Тогда
		УстановитьМодифицированостьФормы(Истина);
		КартаПерейтиКМаркеруТекущегоПартнера(Ложь);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КоординатыОбработкаВыбораИзСписка(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		СтрокаТ = Элементы.Партнеры.ТекущиеДанные;
		УстановитьНовыеКоординаты(СтрокаТ, Результат.Значение, Результат.Представление);
		УстановитьМодифицированостьФормы(Истина);
		КартаПерейтиКМаркеруТекущегоПартнера(Ложь);
		МигатьКоординатами();
	КонецЕсли;

КонецПроцедуры	

// СлужебныеПроцедурыИФункции_КИПартнеров_ВебСервис
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции_КИПартнеров_ЗаписьВБД

// Сохранение измененных координат для Партнеров с признаком КоординатыИзменены.
&НаКлиенте
Процедура СохранитьПродолжить(РезультатОтвета, ДополнительныеПараметры) Экспорт
	
	Если РезультатОтвета = КодВозвратаДиалога.Да Тогда
		СохранитьКоординатыКлиент();
		Закрыть();
	ИначеЕсли РезультатОтвета = КодВозвратаДиалога.Нет Тогда
		УстановитьМодифицированостьФормы(Ложь);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКоординатыКлиент()
	
	Состояние(НСтр("ru = 'Сохранение координат партнеров...'"));
	СохранитьКоординаты();
	УстановитьМодифицированостьФормы(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьКоординаты()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");	
	
	тзРеквизиты = Новый ТаблицаЗначений;
	тзРеквизиты.Колонки.Добавить("Свойство", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"));
	тзРеквизиты.Колонки.Добавить("Значение");
	
	стзШирота = тзРеквизиты.Добавить();	
	стзШирота.Свойство  = ТекОбъект.ДополнительноеСвойствоПоНаименованию(ТекОбъект.ИмяСвойстваШиротаПартнер());	
	стзДолгота = тзРеквизиты.Добавить();
	стзДолгота.Свойство = ТекОбъект.ДополнительноеСвойствоПоНаименованию(ТекОбъект.ИмяСвойстваДолготаПартнер());
	стзАдрес = тзРеквизиты.Добавить();
	стзАдрес.Свойство   = ТекОбъект.ДополнительноеСвойствоПоНаименованию(ТекОбъект.ИмяСвойстваАдресИзСервисаПартнер());
	
	Для каждого СтрокаТ Из Партнеры Цикл
		Если СтрокаТ.КоординатыИзменены Тогда
			стзШирота.Значение  = СтрокаТ.Широта;
			стзДолгота.Значение = СтрокаТ.Долгота;
			стзАдрес.Значение   = СтрокаТ.АдресКоординат;
			УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(СтрокаТ.Партнер, тзРеквизиты);
			СтрокаТ.КоординатыИзменены = Ложь;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

// СлужебныеПроцедурыИФункции_КИПартнеров_ЗаписьВБД
#КонецОбласти

#Область СлужебныеПроцедурыИФункции_КИПартнеров_Мигание

&НаКлиенте
Процедура МигатьКоординатами()
	
	СтрокаТ = Элементы.Партнеры.ТекущиеДанные;
	Если СтрокаТ <> Неопределено Тогда
		СтррКонтекст.Вставить("ЗначениеМигания", СтрокаТ.Координаты);
		СтррКонтекст.КоличествоМиганий = 5; // количество переключений видимости
		ТаймерМигания();
		ПодключитьОбработчикОжидания("ТаймерМигания", 0.15, Истина); // дробные значения принимаются только для однократных таймеров
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаймерМигания()
	
	СтррКонтекст.КоличествоМиганий = СтррКонтекст.КоличествоМиганий - 1;
	СтрокаТ = Элементы.Партнеры.ТекущиеДанные;
	Если СтрокаТ <> Неопределено Тогда
		СтрокаТ.Координаты = ?(СтррКонтекст.КоличествоМиганий % 2 = 0, СтррКонтекст.ЗначениеМигания, "");
		Если СтррКонтекст.КоличествоМиганий <> 0 Тогда
			ПодключитьОбработчикОжидания("ТаймерМигания", 0.15, Истина);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

// СлужебныеПроцедурыИФункции_КИПартнеров_Мигание
#КонецОбласти 

// СлужебныеПроцедурыИФункции_КИПартнеров
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции_СписокТорговыхТочек

&НаКлиенте
Процедура СписокТорговыхТочекВыборЗавершение(СтррРезультат, ДополнительныеПараметры) Экспорт
	
	Если СтррРезультат <> Неопределено Тогда
		СписокТорговыхТочекДобавитьПартнеровИзСписка(СтррРезультат);
		ПредупредитьПользователяОРезультатеДобавленияПартнеров(СтррРезультат);
	КонецЕсли; 
	
КонецПроцедуры

// Вывод предупреждения после добавления партнеров из списка ТТ или добавления всех партнеров в таблицу.
&НаКлиенте
Процедура ПредупредитьПользователяОРезультатеДобавленияПартнеров(СтррРезультат)
	
	Текст = "";
	Если СтррРезультат.Свойство("ИсключеноПартнеровСЗаполненнымиКоординатами") Тогда
		Текст = Текст + НСтр("ru = 'Были исключены партнеры с заполненными координатами'")
			+ " " + НСтр("ru = '(включен режим подбора только для партнеров с пустыми координатами).'")
			+ Символы.ПС + СтрШаблон_(НСтр("ru = 'Исключено партнеров: %1.'"), СтррРезультат.ИсключеноПартнеровСЗаполненнымиКоординатами) + " ";
	КонецЕсли; 
	
	Если СтррРезультат.ДобавленоПартнеров = 0 Тогда
		Если Партнеры.Количество() <> 0 Тогда
			Текст = Текст + НСтр("ru = 'Новых партнеров больше не добавлено, т.к. они уже есть в таблице.'");
		Иначе
			Текст = Текст + НСтр("ru = 'Новых партнеров больше не добавлено.'");
		КонецЕсли; 
	КонецЕсли; 
	
	Если Текст <> "" Тогда
		ПоказатьПредупреждение(, Текст);
	КонецЕсли; 
	
КонецПроцедуры

// Добавление в таблицу на форме партнеров из списков торговых точек (может быть добавлено из нескольких списков ТТ)
&НаСервере
Процедура СписокТорговыхТочекДобавитьПартнеровИзСписка(СтррПараметры)
	
	мВыбранныеЗначения = СтррПараметры.мВыбранныеЗначения; // выбранные списки торговых точек (партнеров)
	
	НачальнаяСтрока = Партнеры.Количество();
	
	мНовыеПартнеры = Новый Массив; // количество добавленных партнеров
	
	ПроверятьНаПустыеКоординаты = Элементы.ПартнерыПризнакТолькоСПустымиКоординатами.Пометка;
	БезТочности = СтррКонтекст.ЗначениеБезТочности;	
	ПрежнееКоличествоПартнеров = Партнеры.Количество();
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");	
	СтррПоиск = Новый Структура("Партнер");
	
	Для каждого Значение Из мВыбранныеЗначения Цикл
		
		СтррОбъект = ТекОбъект.ПолучитьОбъектИзХранилища("СпрСТТ", Значение.ID);
		Если СтррОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		Для каждого стзСостав Из СтррОбъект.Состав Цикл
			Партнер = стзСостав.Партнер;
			СтррПоиск.Партнер = Партнер;
			мСтроки = Партнеры.НайтиСтроки(СтррПоиск);
			Если мСтроки.Количество() = 0 Тогда
				Если Не ПроверятьНаПустыеКоординаты Тогда
					СтрокаТ = Партнеры.Добавить();
					СтрокаТ.Партнер = Партнер;
					СтрокаТ.Точность = БезТочности;
				КонецЕсли; 
				мНовыеПартнеры.Добавить(Партнер);
			КонецЕсли; 
		КонецЦикла; 
		
	КонецЦикла; 
	
	Если мНовыеПартнеры.Количество() <> 0 Тогда // добавлены новые партнеры 
		
		КоличествоВМассивеДоДобавления = мНовыеПартнеры.Количество(); // Если включена проверка на добавление с непустыми координатами, то после вызова 
		ОбновитьКоординатыПартнеров(мНовыеПартнеры, НачальнаяСтрока, Ложь, ПроверятьНаПустыеКоординаты); // этой процедуры из массива будут исключены партнеры с непустыми координатами.
		ОбновитьАдресаПартнеров(мНовыеПартнеры, НачальнаяСтрока, Ложь);
		Если КоличествоВМассивеДоДобавления <> мНовыеПартнеры.Количество() И ПроверятьНаПустыеКоординаты Тогда
			СтррПараметры.Вставить("ИсключеноПартнеровСЗаполненнымиКоординатами", КоличествоВМассивеДоДобавления - мНовыеПартнеры.Количество());
		КонецЕсли; 
		
	КонецЕсли; 
	
	СтррПараметры.Вставить("ДобавленоПартнеров", Партнеры.Количество() - ПрежнееКоличествоПартнеров);	
	
КонецПроцедуры

// СлужебныеПроцедурыИФункции_СписокТорговыхТочек
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции_ДобавлениеВсехПартнеров

&НаКлиенте
Процедура ПартнерыДобавитьВсехПартнеровКлиент()
	
	УстановитьМодифицированостьФормы(Ложь);
	СтррРезультат = ПартнерыДобавитьВсехПартнеров();
	ПредупредитьПользователяОРезультатеДобавленияПартнеров(СтррРезультат);	
	
КонецПроцедуры

// Добавление в таблицу на форме всех партнеров.
&НаСервере
Функция ПартнерыДобавитьВсехПартнеров()
	
	cтррРезультат = Новый Структура;	
	
	Партнеры.Очистить();
	
	мНовыеПартнеры = Новый Массив; // массив добавленных партнеров в элемент "Партнеры"
	БезТочности = СтррКонтекст.ЗначениеБезТочности;	
	ПрежнееКоличествоПартнеров = Партнеры.Количество();
	
	ПроверятьНаПустыеКоординаты = Элементы.ПартнерыПризнакТолькоСПустымиКоординатами.Пометка;	
	
	Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Партнеры.Ссылка
		|ИЗ
		|	Справочник.Партнеры КАК Партнеры
		|ГДЕ 
		|	Партнеры.ПометкаУдаления = ЛОЖЬ";
		
	Запрос = Новый Запрос(Текст);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Не ПроверятьНаПустыеКоординаты Тогда
			СтрокаТ = Партнеры.Добавить();
			СтрокаТ.Партнер  = Выборка.Ссылка;
			СтрокаТ.Точность = БезТочности;
		КонецЕсли;
		мНовыеПартнеры.Добавить(Выборка.Ссылка);
	КонецЦикла; 
	
	Если мНовыеПартнеры.Количество() <> 0 Тогда
		КоличествоВМассивеДоДобавления = мНовыеПартнеры.Количество();
		ОбновитьКоординатыПартнеров(мНовыеПартнеры, 0, Ложь, ПроверятьНаПустыеКоординаты);
		ОбновитьАдресаПартнеров(мНовыеПартнеры, 0, Ложь);
		Если КоличествоВМассивеДоДобавления <> мНовыеПартнеры.Количество() И ПроверятьНаПустыеКоординаты Тогда
			cтррРезультат.Вставить("ИсключеноПартнеровСЗаполненнымиКоординатами", КоличествоВМассивеДоДобавления - мНовыеПартнеры.Количество());
		КонецЕсли;
	КонецЕсли; 
	
	cтррРезультат.Вставить("ДобавленоПартнеров", Партнеры.Количество() - ПрежнееКоличествоПартнеров);
	Возврат cтррРезультат;

КонецФункции

// СлужебныеПроцедурыИФункции_ДобавлениеВсехПартнеров
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции_Карты

#Область СлужебныеПроцедурыИФункции_Карты_КонверсияЗначений

// Конвертирует переданные координаты из формата NMEA  в формат WGS84. 
&НаКлиентеНаСервереБезКонтекста
Функция КонвертироватьNMEAWGS84(Значение)
	
	Пром =  Значение / 100.0;  
	Часы = Пром - (Пром % 1); 
	Минуты = Значение - 100.0 * Часы;
	Результат = Часы + Минуты / 60.0;
	
	Возврат Окр(Результат, 6);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеКоординатNMEA(Широта, Долгота)

	Если Широта = 0 И Долгота = 0 Тогда
		Возврат "";
	Иначе
		Возврат Строка(Широта) + "; " + Строка(Долгота);			
	КонецЕсли; 

КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция ЧислоВСтроку(Число) 
	
	Возврат СтрЗаменить(СтрЗаменить(Строка(Число), " ", ""), ",", ".");
	
КонецФункции

// СлужебныеПроцедурыИФункции_Карты_КонверсияЗначений
#КонецОбласти 

&НаКлиенте
Процедура КартаПереключитьРежимВыбораКоординат(Режим = "НеМенять", ВыборЦентраКарты = Ложь)
	
	СтррКонтекст.РежимВыбораЦентраКарты = ВыборЦентраКарты;
	
	Если ТипЗнч(Режим) = Тип("Булево") Тогда
	    РежимВыбораКоординат = Режим;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КартаОбновитьТекущийМакет()
	
	// Важно, чтобы в момент обновления карты диалоговый элемент "ПолеБраузера" не был сфокусирован,
	// иначе происходит ошибка выполнения JavaScript. (Баг работы с COM-объеткми?).
	Если ЭтаФорма.ТекущийЭлемент.Имя = "ПолеБраузера" Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ИсточникКарты; // Убираем фокус с "ПолеБраузера"
	КонецЕсли;
	
	ТекстМакета	= МодульКарты.ПолучитьСкриптКарты(ИсточникКарты);
	
	#Если Не ВебКлиент Тогда
		Документ = Элементы.ПолеБраузера.Document;	
		
		КартаЗагрузитьМакет(Документ, ТекстМакета);
		
		ОкноБраузера = Документ.parentWindow; // IE
	    Если ОкноБраузера = Неопределено Тогда
	        ОкноБраузера = Документ.defaultView; // Прочие браузеры
		КонецЕсли;
		
		ПоказатьМаркер = СтррМаркер.Широта <> 0 И Партнеры.Количество() <> 0;
		
		стррЦентр = ?(ПоказатьМаркер, СтррМаркер, СтррКонтекст.КартаЦентр); // если маркер еще не использовался, показываем центр карты
		
		//передаем параметр, показывающий, что файл скрипта используется для Редактора маршрута		
		ОкноБраузера.name = КартаСформироватьПараметрРежимРедактора("LabelEditor", стррЦентр);
	#Иначе
		ТекстСкрипта = ТекстМакета;
	#КонецЕсли
	
КонецПроцедуры

// Выполняет загрузку скрипта карты из текста макета
//
//  Параметры:
//   Документ 		- COM-объект - поле html-документа
//   ТекстМакета 	- Строка - текст скрипта
//
&НаКлиенте
Процедура КартаЗагрузитьМакет(Документ, ТекстМакета)

	Попытка
		Документ.designMode = "On";
		Документ.write(ТекстМакета);	
		Документ.designMode = "Off"; 
	Исключение
		Попытка
			Документ.body.document.designMode = "On";
			Документ.write(ТекстМакета);
			Документ.body.document.designMode = "Off";
		Исключение
			ТекстСкрипта = ТекстМакета;
		КонецПопытки;
	КонецПопытки; 
	
КонецПроцедуры

// Формирует параметр "Режим редактора" (режим + координаты центра карты - при их наличии)
//
//  Параметры:
//   РежимРедактора - Строка - режим редактора
//   стррЦентр.Широта 	- широта для позиционирования центра карты
//   стррЦентр.Долгота  - долгота для позиционирования центра карты
//
//  Возвращаемое значение:
//   РежимРедактора - Строка - режим редактора с координатами центра карты (при их наличии)  
//
&НаКлиентеНаСервереБезКонтекста
Функция КартаСформироватьПараметрРежимРедактора(РежимРедактора, стррЦентр = Неопределено) Экспорт
	
	Если ТипЗнч(стррЦентр) = Тип("Структура") И стррЦентр.Свойство("Широта") Тогда
		стрШирота  = ЧислоВСтроку(КонвертироватьNMEAWGS84(стррЦентр.Широта));
		стрДолгота = ЧислоВСтроку(КонвертироватьNMEAWGS84(стррЦентр.Долгота));
	Иначе
		стрШирота  = "0";
		стрДолгота = "0";
	КонецЕсли; 
	
	Возврат стрШирота + "@" + стрДолгота + "@" + РежимРедактора;	
	
КонецФункции

#Область СлужебныеПроцедурыИФункции_Карты_Маркер

&НаКлиенте
Процедура КартаПерейтиКМаркеруТекущегоПартнера(Принудительно)
	
	СтрокаТ = Элементы.Партнеры.ТекущиеДанные;
	Если СтрокаТ <> Неопределено Тогда
		
		Если Не Принудительно И СтррМаркер.Широта = СтрокаТ.Широта И СтррМаркер.Долгота = СтрокаТ.Долгота Тогда
			Возврат; // координаты маркера не менялись
		КонецЕсли; 
		
		СтррМаркер.Широта    = СтрокаТ.Широта;
		СтррМаркер.Долгота   = СтрокаТ.Долгота;
		СтррМаркер.Заголовок = Строка(СтрокаТ.Партнер);
		
		Если СтррМаркер.Широта <> 0 И СтррМаркер.Долгота <> 0 Тогда 
			КартаПерейтиКМаркеру(Истина);
			КартаДобавитьМаркер(Истина);
		КонецЕсли;
	
	КонецЕсли; 

КонецПроцедуры		

&НаКлиенте
Процедура КартаПерейтиКМаркеру(УстановитьТаймер = Ложь)
	
	Документ = Элементы.ПолеБраузера.Document;
	
	ОкноБраузера = Документ.parentWindow; // IE
    Если ОкноБраузера = Неопределено Тогда
        ОкноБраузера = Документ.defaultView; // Прочие браузеры
	КонецЕсли;
	
	Широта 	= СтррМаркер.Широта;
	Долгота = СтррМаркер.Долгота;
	
	Если Не УстановитьТаймер Тогда 
		ОкноБраузера.GoToMarker(Широта, Долгота);
	Иначе
		Попытка
			ОкноБраузера.GoToMarker(Широта, Долгота);
		Исключение
			Таймер_Включить("ПерейтиКМаркеру");	
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Процедура располагает на карте маркер из реквизита стррМаркер.
&НаКлиенте
Процедура КартаДобавитьМаркер(УстановитьТаймер = Ложь)
	
	Если СтррМаркер.Широта = 0 И СтррМаркер.Долгота = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Описание 		= "";
	Подвал 			= "";
	Подсказка 		= "";
	Порядок  		= "";
	
	ИмяФайлаИконки = "tpnochek.png";
	
	ОтображаемаяИконка = СтррКонтекст.КаталогИконок + ИмяФайлаИконки;
	
	Попытка 
		
		Документ 		= Элементы.ПолеБраузера.Document;		
		ОкноБраузера 	= Документ.parentWindow; // IE
	    Если ОкноБраузера = Неопределено Тогда
	        ОкноБраузера = Документ.defaultView; // Прочие браузеры
		КонецЕсли;
		
		ОкноБраузера.ClearCollection();	// удаление всех маркеров
		ОкноБраузера.setMarker(СтррМаркер.Широта, СтррМаркер.Долгота, ОтображаемаяИконка, СтррМаркер.Заголовок, Описание, Подвал, Подсказка, Порядок, Ложь);
		
	Исключение
		
		Если УстановитьТаймер Тогда 
			Таймер_Включить("ДобавитьМаркер");	
		Иначе	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При построении карты произошла ошибка. Возможно, карта не загружена.");
		КонецЕсли;	
		
	КонецПопытки;
	
КонецПроцедуры

// СлужебныеПроцедурыИФункции_Карты_Маркер
#КонецОбласти

#Область СлужебныеПроцедурыИФункции_Карты_Таймер

// Процедура включает таймер обработки очереди событий для поля браузера, 
// при этом в стек событий (ТаймерОжидания.Очередь) добавляется новое событие.
// Процедура обработки событий таймера объявляется в модуле формы и должна называться "Таймер_Обработчик".
// Также должен быть объявлен реквизит формы ТаймерОжидания.
// Реквизит формы "ТаймерОжидания" используется для организациии очереди передачи команд в поле браузера, 
// т.к. поле браузера работает асинхронно и может запаздывать с реакцией на команды.
&НаКлиенте
Процедура Таймер_Включить(Событие)
	Если ТипЗнч(ТаймерОжидания) <> Тип("Структура") Тогда // реквизит еще не инициализировался
		ТаймерОжидания = Новый Структура("Включен,Очередь,Время", Ложь);
		ТаймерОжидания.Очередь = Новый Массив; // стэк событий для взаимодействия с полем браузера (обрабатывается в порядке добавления событий) 
	КонецЕсли;
	Если ТаймерОжидания.Очередь.Найти(Событие) = Неопределено Тогда
		ТаймерОжидания.Очередь.Добавить(Событие);
		ТаймерОжидания.Время = ТекущаяДата();
	КонецЕсли;
	Если Не ТаймерОжидания.Включен Тогда
		ТаймерОжидания.Включен = Истина;
		ПодключитьОбработчикОжидания("Таймер_Обработчик", 1);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Таймер_Обработчик()
	
	Если ТекущаяДата() - ТаймерОжидания.Время > 5 Тогда // время с момента постановки события в очередь привысило 5 секунд - прекращаем обрабатывать все события
		Таймер_Выключить(Истина);
	КонецЕсли;
	Событие =  ТаймерОжидания.Очередь[0];
	Попытка
		Если Событие = "ДобавитьМаркер" Тогда
			КартаДобавитьМаркер();
		ИначеЕсли Событие = "ПерейтиКМаркеру" Тогда
			КартаПерейтиКМаркеру();
		ИначеЕсли Событие = "КартаОбновитьТекущийМакет" Тогда
			КартаОбновитьТекущийМакет();
		ИначеЕсли Лев(Событие, 1) = "!" Тогда // событие - строка кода для выполнения
			Выполнить(Сред(Событие, 2) + ";");
		КонецЕсли;
	Исключение
		Возврат;
	КонецПопытки;
	Таймер_Выключить(Ложь);
	
КонецПроцедуры

// Процедура выключает таймер обработки очереди событий для поля браузера, 
// или удаляет из очереди первое событие.
// Процедура обработки событий таймера объявляется в модуле формы и должна называться "Таймер_Обработчик".
&НаКлиенте
Процедура Таймер_Выключить(Знач ВыключитьДляВсехСобытий)
	Если Не ВыключитьДляВсехСобытий Тогда
		ТаймерОжидания.Очередь.Удалить(0);
		Если ТаймерОжидания.Очередь.Количество() = 0 Тогда
			ВыключитьДляВсехСобытий = Истина;
	    КонецЕсли;
	КонецЕсли;
	Если ВыключитьДляВсехСобытий Тогда
		ТаймерОжидания.Включен = Ложь;
		ОтключитьОбработчикОжидания("Таймер_Обработчик");
	КонецЕсли;
КонецПроцедуры

// СлужебныеПроцедурыИФункции_Карты_Таймер
#КонецОбласти

// СлужебныеПроцедурыИФункции_Карты
#КонецОбласти 

// СлужебныеПроцедурыИФункции
#КонецОбласти 
