
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СтррКонтекст = Новый Структура("Ключ");
	ТекОбъект = РеквизитФормыВЗначение("Объект");		
	ТекОбъект.КонтекстФормыИнициализировать(СтррКонтекст, Параметры);
	
	Если Не Параметры.Свойство("ВремяНачала") Или Не Параметры.Свойство("ВремяОкончания") Или Не Параметры.Свойство("Ключ") Тогда
		ВызватьИсключение("Форма """ + ЭтаФорма.Заголовок + """ - не получены все параметры: Ключ, ВремяНачала, ВремяОкончания.");
	КонецЕсли; 
	
	ВремяНачала 	= Параметры.ВремяНачала;
	ВремяОкончания 	= Параметры.ВремяОкончания;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если ВремяОкончания < ВремяНачала Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru='Время указано неверно'"));
	Иначе
		СтррПараметры = Новый Структура("КодВозвратаДиалога,Ключ,ВремяНачала,ВремяОкончания", 
			КодВозвратаДиалога.ОК, СтррКонтекст.Ключ, ВремяНачала, ВремяОкончания);
		Закрыть(СтррПараметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВремяНачалаПриИзменении(Элемент)
	
	Если ВремяОкончания < ВремяНачала Тогда
		ВремяОкончания = ВремяНачала;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Если ВремяОкончания < ВремяНачала Тогда
		ВремяОкончания = ВремяНачала;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияПриИзменении(Элемент)
	
	Если ВремяОкончания < ВремяНачала Тогда
		ВремяНачала = ВремяОкончания;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Если ВремяОкончания < ВремяНачала Тогда
		ВремяНачала = ВремяОкончания;
	КонецЕсли;

КонецПроцедуры

// ОбработчикиСобытийЭлементовФормы
#КонецОбласти
