
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтррКонтекст = Новый Структура("Значения");
	ТекОбъект = РеквизитФормыВЗначение("Объект");		
	ТекОбъект.КонтекстФормыИнициализировать(СтррКонтекст, Параметры);
	
	Если Не Параметры.Свойство("Значения") Тогда
		ВызватьИсключение("Форма """ + ЭтаФорма.Заголовок + """ - отсутствует свойство Параметр.Значения.");
	КонецЕсли; 
	
	Список = Элементы.РежимПоискаПользователей.СписокВыбора;
	Список.Добавить("НеИскать", 				НСтр("ru = 'Не искать пользователей'"));
	Список.Добавить("ИскатьПоТочномуЗначению", 	НСтр("ru = 'Искать по точному значению ""ЛК.Сотрудник""'"));	
	Список.Добавить("ИскатьПоВхождению", 		НСтр("ru = 'Искать по вхождению слов из ""ЛК.Сотрудник""'"));
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.Значения);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДоступностьЭлементовПоиска();
КонецПроцедуры

// ОбработчикиСобытийФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ЗаполнитьЗначенияСвойств(СтррКонтекст.Значения, ЭтотОбъект);
	Закрыть(СтррКонтекст.Значения);
	
КонецПроцедуры

// ОбработчикиКомандФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РежимПоискаПользователейОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РежимПоискаПользователейПриИзменении(Элемент)
	ОбновитьДоступностьЭлементовПоиска();
КонецПроцедуры

// ОбработчикиСобытийЭлементовФормы
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьДоступностьЭлементовПоиска()
	
	ДоступностьЭлементов = (РежимПоискаПользователей <> "НеИскать");
	Элементы.СоздаватьНовыхПользователей.Доступность = ДоступностьЭлементов;
	Элементы.ТолькоДляНовыхИОбновленныхМУ.Доступность = ДоступностьЭлементов;
	
КонецПроцедуры

// СлужебныеПроцедурыИФункции
#КонецОбласти