
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтррКонтекст = Новый Структура("Местоположение,КодСтраны");	
	ТекОбъект = РеквизитФормыВЗначение("Объект");	
	ТекОбъект.КонтекстФормыИнициализировать(СтррКонтекст, Параметры); 	

	СтррКонтекст.Местоположение = ТекОбъект.ПрочитатьЗначениеНастройки("МестоположениеДляИнформера");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	МодульКарты = ПолучитьФорму(СтррКонтекст.ПутьКФорме + "МодульКарты");
	СтррКонтекст.КодСтраны = МодульКарты.КодСтраныМестоположения(СтррКонтекст.Местоположение);
	
	Если СтррКонтекст.КодСтраны = "UA" Тогда
		Элементы.НомерТелефона.Заголовок = "+38 (048) 701-71-15";
		Элементы.АдресПочты.Заголовок = "support-ua@agentplus.com.ua";
		Элементы.ОбратныйЗвонок.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура АдресПочтыНажатие(Элемент)
	
	ПараметрыОткрытия = Новый Структура("Основание", ПараметрыПисьмаВТехподдержку());
	ФормаПисьмаВТехническуюПоддержку = ПолучитьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.ФормаДокумента", ПараметрыОткрытия);
	ФормаПисьмаВТехническуюПоддержку.Объект.Тема = "Обращение в техническую поддержку компании ""Агент Плюс""";
	ФормаПисьмаВТехническуюПоддержку.ТекстПисьма = ТекстПисьма();
	ФормаПисьмаВТехническуюПоддержку.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбратныйЗвонокНажатие(Элемент)
	
	ЗапуститьПриложение("http://www.agentplus.ru/services/#callback");
	
КонецПроцедуры

&НаКлиенте
Процедура ДистрибутивМТБазоваяНажатие(Элемент)
	
	Если СтррКонтекст.КодСтраны = "UA" Тогда
		ЗапуститьПриложение("http://www.agentplus.com.ua/mobiletrade");
	Иначе
		ЗапуститьПриложение("http://www.agentplus.ru/downloads/#mt");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДистрибутивПлатформыНажатие(Элемент)
	
	Если СтррКонтекст.КодСтраны = "UA" Тогда
		ЗапуститьПриложение("http://www.agentplus.com.ua/applatform");
	Иначе
		ЗапуститьПриложение("http://www.agentplus.ru/downloads/#platform");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродуктыАгентПлюсНажатие(Элемент)
	
	Если СтррКонтекст.КодСтраны = "UA" Тогда
		ЗапуститьПриложение("http://www.agentplus.com.ua/products");
	Иначе
		ЗапуститьПриложение("http://www.agentplus.ru/downloads/");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПартнераНажатие(Элемент)
	
	Если СтррКонтекст.КодСтраны = "UA" Тогда
		ЗапуститьПриложение("http://www.agentplus.com.ua/partners");
	Иначе
		ЗапуститьПриложение("http://www.agentplus.ru/partners/");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресСайтаНажатие(Элемент)
	
	ЗапуститьПриложение("http://www.agentplus.ru");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЛКСсылкаНажатие(Элемент)
	ЗапуститьПриложение("https://agentplus.online/");
КонецПроцедуры

// ОбработчикиСобытийЭлементовФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

//Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПараметрыПисьмаВТехподдержку()

	Контакты = Новый Структура;
	Контакты.Вставить("Адрес", Элементы.АдресПочты.Заголовок);
	Контакты.Вставить("Контакт", "");
	Контакты.Вставить("Представление", "Служба техподдержки ""Агент Плюс""");
	
	Основание = Новый Структура;
	Основание.Вставить("Основание", Неопределено);
	Основание.Вставить("Команда", "Отправить");
	Основание.Вставить("Контакт", Контакты);
	
	Возврат Основание;
	
КонецФункции // ПараметрыПисьмаВТехподдержку()

&НаСервере
Функция ТекстПисьма()

	Текст = "/ЗДЕСЬ НЕОБХОДИМО ПОДРОБНО ОПИСАТЬ СУТЬ ПРОБЛЕМЫ ИЛИ ПРЕДЛОЖЕНИЯ/";
	// Оставляем место для текста пользователя
	Для Сч=0 По 5 Цикл
		Текст = Текст + Символы.ПС;	
	КонецЦикла;
	
	Текст = Текст + "/БЛОК ИНФОРМАЦИИ О СИСТЕМЕ, СОБРАННОЙ АВТОМАТИЧЕСКИ.
		|УБЕДИТЕЛЬНО ПРОСИМ НЕ УДАЛЯТЬ СОБРАННЫЕ СИСТЕМОЙ СВЕДЕНИЯ, ЗА ИСКЛЮЧЕНИЕМ ТЕХ,
		|КОТОРЫЕ ВЫ СОЧТЕТЕ СЕКРЕТНЫМИ
		|КОМПАНИЯ РАЗРАБОТЧИК ОБЯЗУЕТСЯ СОХРАНЯТЬ КОНФИДЕНЦИАЛЬНОСТЬ ВСЕЙ ПОЛУЧЕННОЙ ИНФОРМАЦИИ/";
		
		// Получаем информацию о программе стандартными методами 1С
		Текст = Текст + Символы.ПС;
		Текст = Текст + Символы.ПС;
		Текст = Текст + "ИНФОРМАЦИЯ О ПРОГРАММЕ:";
		Текст = Текст + Символы.ПС;
		Текст = Текст + ТекстИнформацииОПрограмме();
		//
		
	Возврат Текст;
КонецФункции // ТекстПисьма()

&НаСервере
Функция ТекстИнформацииОПрограмме()
	
	Текст = "";
	Текст = Текст + "Конфигурация: " + Метаданные.Имя  + " (" + Метаданные.Синоним + ")";	
	Текст = Текст + Символы.ПС;	
	Текст = Текст + "Поставщик: " + Метаданные.Поставщик;
	Текст = Текст + Символы.ПС;	
	Текст = Текст + "Версия: " + Метаданные.Версия;	
	Текст = Текст + Символы.ПС;
	
	Текст = Текст + "Версия модуля обмена данными: " + Объект.ВерсияНастроек;	
	Текст = Текст + Символы.ПС;
	
	Текст = Текст + "Пользователь: " + ИмяПользователя();	 	
	Текст = Текст + Символы.ПС;	
	Текст = Текст + "Полное имя пользователя: " + ПолноеИмяПользователя();
	Текст = Текст + Символы.ПС;	
	Текст = Текст + "Имя компьютера: " + ИмяКомпьютера();
	Текст = Текст + Символы.ПС;	
	Текст = Текст + "Каталог программы: " + КаталогПрограммы();
	Текст = Текст + Символы.ПС;	
	Текст = Текст + "Каталог временных файлов: " + КаталогВременныхФайлов();    
	Текст = Текст + Символы.ПС;	
	Текст = Текст + "Код локализации: " + КодЛокализации();
	Текст = Текст + Символы.ПС;	
	Текст = Текст + "Строка соединения ИБ: " + СтрокаСоединенияИнформационнойБазы(); 
	
	Возврат Текст;
КонецФункции // ТекстИнформацииОПрограмме()

#КонецОбласти
