#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекОбъект = РеквизитФормыВЗначение("Отчет");
	
	Настройки = ТекОбъект.ПрочитатьЗначенияНастроек("КаталогДанных");

	ПодкаталогФотграфий = ТекОбъект.ПодкаталогДанных("Фотографии",Настройки.КаталогДанных);	
	
	ДанныеФото = ТекОбъект.ПолучитьОбъектИзХранилища("СпрФото", Параметры["ID"]);
	ХранимыйФайл = ПодкаталогФотграфий + ДанныеФото.ХранимыйФайл;	
	ОписаниеФото = ДанныеФото.Описание;
	
	Если Параметры.Свойство("Наименование") Тогда
		ЭтотОбъект.Заголовок = Параметры["Наименование"];
	Иначе
		ЭтотОбъект.Заголовок = "Просмотр фото";
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Оповещение  =  Новый ОписаниеОповещения("ОбработатьВыборФайла",   ЭтотОбъект);
	НачатьПомещениеФайла(Оповещение,АдресКартинки,ХранимыйФайл, Ложь, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыборФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		
		Файл = Новый Файл(ВыбранноеИмяФайла);
		
		Если Файл.Существует() Тогда
						
			АдресКартинки = Адрес;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьПриложение(Команда)
	
	ЗапуститьПриложение(ХранимыйФайл);	
	
КонецПроцедуры

#КонецОбласти