
#Область ГлобальныеПеременные

&НаКлиенте
Перем гМодульК;  // общий клиентский модуль

// ГлобальныеПеременные
#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтррКонтекст = Новый Структура("Страницы,ПутьКСправке");
	ТекОбъект = РеквизитФормыВЗначение("Объект");		
	ТекОбъект.КонтекстФормыИнициализировать(СтррКонтекст, Параметры);
	
	ИнициализироватьСвязиРазделовСправки();
	
	СтррКонтекст.ПутьКСправке = "https://help.agentplus.online/mtbase/ut11/v1/";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отказ = Истина;
КонецПроцедуры

// ОбработчикиСобытийФормы
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьСвязиРазделовСправки()
	
	ствСтраницы = Новый Соответствие;
	
	// Главная страница
	ствСтраницы.Вставить("ГлавнаяФорма", 				"obshchaya_informatsiya");
	ствСтраницы.Вставить("ГлавнаяФорма_Главная", 		"domashnyaya_stranitsa");
	ствСтраницы.Вставить("ГлавнаяФорма_ОбменДанными", 	"obmen_dannymi_1");
	ствСтраницы.Вставить("ГлавнаяФорма_Справочники", 	"spravochniki_1");
	ствСтраницы.Вставить("ГлавнаяФорма_Документы", 		"dokumenty_1");
	ствСтраницы.Вставить("ГлавнаяФорма_ПланированиеИКонтроль", 	"planirovanie_i_kontrol_2");
	ствСтраницы.Вставить("ГлавнаяФорма_Сервис", 		"servis");
	ствСтраницы.Вставить("ГлавнаяФорма_Помощь", 		"pomoshch");
	
	ствСтраницы.Вставить("ЛичныйКабинет", 				"nastrojka_dostupa_v_lichnyj_kabinet");
	
	// Справочники
	ствСтраницы.Вставить("НастройкиАгентов",			"torgovye_agenty");
	ствСтраницы.Вставить("МобильныеУстройства",			"mobilnye_ustrojstva");
	ствСтраницы.Вставить("СпискиТорговыхТочек",			"spiski_torgovykh_tochek");
	
	ствСтраницы.Вставить("СписокТорговыхТочек",			"vkladka__spisok_");
	ствСтраницы.Вставить("СписокТорговыхТочек_ГруппаСписок",		"vkladka__spisok_");
	ствСтраницы.Вставить("СписокТорговыхТочек_ГруппаПланПосещений",	"vkladka__plan_poseshchenij_");
	ствСтраницы.Вставить("СписокТорговыхТочек_ГруппаДополнительно",	"vkladka__dopolnitelno__3");
	
	// Документы
	ствСтраницы.Вставить("Документы_Посещение",			"poseshcheniya");
	
	
	// Общие настройки
	ствСтраницы.Вставить("НастройкиМодуля", 					"obshchie_nastrojki");
	ствСтраницы.Вставить("НастройкиМодуля_ГруппаОсновные", 		"vkladka__osnovnye_");
	ствСтраницы.Вставить("НастройкиМодуля_ГруппаДополнительно", "vkladka__dopolnitelno__2");
	ствСтраницы.Вставить("НастройкиМодуля_ГруппаКаталоги", 		"vkladka__katalogi_");
	
	// Настройка мобильного приложения
	ствСтраницы.Вставить("НастройкиМобильногоПриложения", 		"nastrojka_mobilnogo_prilozheniya_na_ustrojstve"); // gi_170914
	
	ствСтраницы.Вставить("НастройкиМодуля_КаталогДанныхДляСервера_Windows", "katalog_dannykh_na_servere_windows");
	ствСтраницы.Вставить("НастройкиМодуля_КаталогДанныхДляСервера_Linux", 	"katalog_dannykh_na_servere_linux");	
	
	// Планирование и контроль
	ствСтраницы.Вставить("ОтчетВыполнениеПланаПосещений", 		"vypolnenie_plana_poseshchenij"); 			// gi_170909
	ствСтраницы.Вставить("ОтчетКонтрольПередвиженийАгентов", 	"kontrol_peredvizhenij_torgovykh_agentov"); // gi_170909
	ствСтраницы.Вставить("РедакторМеток", 						"zapolnit_koordinaty_partnerov"); // gi_170902	
	
	СтррКонтекст.Страницы = ствСтраницы;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнийВызовОткрытьСправку(Знач ПутьКСтранице) Экспорт
	
	Страница = МодульК().ПоследнийЭлементСтроки(ПутьКСтранице);
	
	ИдентификаторРаздела = СтррКонтекст.Страницы.Получить(Страница);
	
	Если ИдентификаторРаздела = Неопределено Тогда
		ИдентификаторРаздела = "index";
	КонецЕсли;
	
	ИмяФайла = ИдентификаторРаздела + ".htm";
	
	ЗапуститьПриложение(СтррКонтекст.ПутьКСправке + ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Функция МодульК()

	Если гМодульК = Неопределено Тогда
	    гМодульК = ПолучитьФорму(СтррКонтекст.ПутьКФорме + "МодульОбщий", СтррКонтекст);
	КонецЕсли; 
	
	Возврат гМодульК;

КонецФункции

// СлужебныеПроцедурыИФункции
#КонецОбласти
