
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтррКонтекст = Новый Структура("Значения");
	ТекОбъект = РеквизитФормыВЗначение("Объект");		
	ТекОбъект.КонтекстФормыИнициализировать(СтррКонтекст, Параметры);
	
	Если Не Параметры.Свойство("Значения") Тогда
		ВызватьИсключение("Форма """ + ЭтаФорма.Заголовок + """ - отсутствует свойство Параметр.Значения.");
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.Значения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьПредставлениеКоординат();
КонецПроцедуры

// ОбработчикиСобытийФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ЗаполнитьЗначенияСвойств(СтррКонтекст.Значения, ЭтотОбъект);
	Закрыть(СтррКонтекст.Значения);
	
КонецПроцедуры

// ОбработчикиКомандФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ШиротаПриИзменении(Элемент)
	ОбновитьПредставлениеКоординат();
КонецПроцедуры

&НаКлиенте
Процедура ДолготаПриИзменении(Элемент)
	ОбновитьПредставлениеКоординат();
КонецПроцедуры

// ОбработчикиСобытийЭлементовФормы
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьПредставлениеКоординат()
	Элементы.ДекорацияШирота.Заголовок  = NMEAвСтроку(Широта);
	Элементы.ДекорацияДолгота.Заголовок = NMEAвСтроку(Долгота);
КонецПроцедуры

// Возвращает строку-представление координат в читабельном для пользователя виде.
// Координаты передаются в формате NMEA.
&НаКлиентеНаСервереБезКонтекста
Функция NMEAвСтроку(Коор)
	
	Ч = Цел(Коор / 100);
	М = Цел(Коор - 100*Ч);
	С = Окр((Коор - Цел(Коор))*60, 2);
	ЧСтр = Строка(Ч);
	МСтр = Формат(М, "ЧЦ=2;ЧВН=;ЧН=");
	ССтр = Формат(С, "ЧЦ=4;ЧДЦ=2;ЧРД=.;ЧВН=;ЧН=");
	
	Возврат ЧСтр + "°" + МСтр + "'" + ССтр + """";
	
КонецФункции

// СлужебныеПроцедурыИФункции
#КонецОбласти
