
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");		
	ТекОбъект.КонтекстФормыИнициализировать(СтррКонтекст, Параметры);
	
	Если Не Параметры.Свойство("ДатаНачала") Или Не Параметры.Свойство("ДатаОкончания") Тогда
		ВызватьИсключение("Форма """ + ЭтаФорма.Заголовок + """ - не получены все параметры: ДатаНачала, ДатаОкончания.");
	КонецЕсли; 
	
	ДатаНачала 		= Параметры.ДатаНачала;
	ДатаОкончания 	= Параметры.ДатаОкончания;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)

	Если ДатаОкончания < ДатаНачала Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru='Период указан неверно'"));
	Иначе
		СтррПараметры = Новый Структура("КодВозвратаДиалога,ДатаНачала,ДатаОкончания", 
			КодВозвратаДиалога.ОК, ДатаНачала, ДатаОкончания);
		Закрыть(СтррПараметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	Если ДатаОкончания < ДатаНачала Тогда
		ДатаОкончания = ДатаНачала;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаРегулирование(Элемент, Направление, СтандартнаяОбработка)

	Если ДатаОкончания < ДатаНачала Тогда
		ДатаОкончания = ДатаНачала;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	Если ДатаОкончания < ДатаНачала Тогда
		ДатаНачала = ДатаОкончания;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Если ДатаОкончания < ДатаНачала Тогда
		ДатаНачала = ДатаОкончания;
	КонецЕсли;

КонецПроцедуры

// ОбработчикиСобытийЭлементовФормы
#КонецОбласти
